#include <iostream>
#include <vector>
#include <queue>
using namespace std;
char f_v[3][3]= {
    {'r','r','r'},{'r','r','r'},{'r','r','r'}
};
// 왼: g
char l_v[3][3]= {
    {'g','g','g'},{'g','g','g'},{'g','g','g'}
};
// 오: b
char r_v[3][3]= {
    {'b','b','b'},{'b','b','b'},{'b','b','b'}
};
// 뒤: o
char b_v[3][3]= {
    {'o','o','o'},{'o','o','o'},{'o','o','o'}
};
// 위: w
char u_v[3][3]= {
    {'w','w','w'},{'w','w','w'},{'w','w','w'}
};
// 아래: y
char d_v[3][3]= {
    {'y','y','y'},{'y','y','y'},{'y','y','y'}
};

void init(){
    for(int i=0; i<3;i++)for(int j=0;j<3;j++) {
        f_v[i][j]='r';
        l_v[i][j]='g';
        r_v[i][j]='b';
        b_v[i][j]='o';
        u_v[i][j]='w';
        d_v[i][j]='y';
    }
}

void front(bool tf){


    // f-> l,r,u,d
    // +
    if(tf){
        char past_v= f_v[0][0];
        f_v[0][0]= f_v[2][0];
        f_v[2][0]= f_v[2][2];
        f_v[2][2]= f_v[0][2];
        f_v[0][2]= past_v;
        past_v= f_v[0][1];
        f_v[0][1]= f_v[1][0];
        f_v[1][0]= f_v[2][1];
        f_v[2][1]= f_v[1][2];
        f_v[1][2]= past_v;
        char past[3]= {u_v[2][0],u_v[2][1],u_v[2][2]};
        // 왼쪽 2,5,2 -> 상단 2,1,0
        u_v[2][2]=l_v[0][2];
        u_v[2][1]=l_v[1][2];
        u_v[2][0]=l_v[2][2];
        // 하단 0,1,2 -> 왼쪽 2,5,2
        l_v[0][2] = d_v[0][0];
        l_v[1][2] = d_v[0][1];
        l_v[2][2] = d_v[0][2];
        // 우측 1,3,5 -> 하단 2,1,0
        d_v[0][2]=r_v[0][0];
        d_v[0][1]=r_v[1][0];
        d_v[0][0]=r_v[2][0];
        // 상단 0,1,2 -> 우측 1,3,5
        r_v[0][0] = past[0];
        r_v[1][0] = past[1];
        r_v[2][0] = past[2];
    }else{
        char past_v= f_v[0][0];
        f_v[0][0]= f_v[0][2];
        f_v[0][2]= f_v[2][2];
        f_v[2][2]= f_v[2][0];
        f_v[2][0]= past_v;
        past_v= f_v[0][1];
        f_v[0][1]= f_v[1][2];
        f_v[1][2]= f_v[2][1];
        f_v[2][1]= f_v[1][0];
        f_v[1][0]= past_v;
        char past[3]= {u_v[2][0],u_v[2][1],u_v[2][2]};
        // 우측 1,3,5 -> 상단 0,1,2
        u_v[2][0] = r_v[0][0];
        u_v[2][1] = r_v[1][0];
        u_v[2][2] = r_v[2][0];
        // 하단 0,1,2 -> 우측 5,3,1
        r_v[2][0] = d_v[0][0]; 
        r_v[1][0] = d_v[0][1];
        r_v[0][0] = d_v[0][2];
        // 좌측 2,5,2 -> 하단 0,1,2
        d_v[0][0] = l_v[0][2];
        d_v[0][1] = l_v[1][2];
        d_v[0][2] = l_v[2][2];
        // 상단 0,1,2 -> 좌측 2,5,2
        l_v[0][2] = past[2];
        l_v[1][2] = past[1];
        l_v[2][2] = past[0];
    }
}

// l, u 반대
// r, d 반대 
// 
void back(bool tf){
    // b-> u,l,d,r
    // +  
    if(tf){
        char past_v= b_v[0][0];
        b_v[0][0]= b_v[2][0];
        b_v[2][0]= b_v[2][2];
        b_v[2][2]= b_v[0][2];
        b_v[0][2]= past_v;
        past_v= b_v[0][1];
        b_v[0][1]= b_v[1][0];
        b_v[1][0]= b_v[2][1];
        b_v[2][1]= b_v[1][2];
        b_v[1][2]= past_v;
        char past[3]= {u_v[0][0],u_v[0][1],u_v[0][2]};
        // r -> u 
        u_v[0][0]=r_v[0][2];
        u_v[0][1]=r_v[1][2];
        u_v[0][2]=r_v[2][2];
        // d -> r
        r_v[2][2]=d_v[2][0];
        r_v[1][2]=d_v[2][1];
        r_v[0][2]=d_v[2][2];
        // l -> d
        d_v[2][0]=l_v[0][0];
        d_v[2][1]=l_v[1][0];
        d_v[2][2]=l_v[2][0];
        // u -> l
        l_v[2][0]=past[0];
        l_v[1][0]=past[1];
        l_v[0][0]=past[2];
    }else{
        char past_v= b_v[0][0];
        b_v[0][0]= b_v[0][2];
        b_v[0][2]= b_v[2][2];
        b_v[2][2]= b_v[2][0];
        b_v[2][0]= past_v;
        past_v= b_v[0][1];
        b_v[0][1]= b_v[1][2];
        b_v[1][2]= b_v[2][1];
        b_v[2][1]= b_v[1][0];
        b_v[1][0]= past_v;
        char past[3]= {u_v[0][0],u_v[0][1],u_v[0][2]};
        // l 0,3,0 -> u 2,1,0
        u_v[0][2] = l_v[0][0];
        u_v[0][1] = l_v[1][0];
        u_v[0][0] = l_v[2][0];
        // d 0,1,2 -> l 0,3,0;
        l_v[0][0] = d_v[2][0];
        l_v[1][0] = d_v[2][1];
        l_v[2][0] = d_v[2][2];
        // r 2,5,2 -> d 2,1,0;
        d_v[2][2] = r_v[0][2];  
        d_v[2][1] = r_v[1][2]; 
        d_v[2][0] = r_v[2][2]; 
        // u 0,1,2 -> r 2,5,2;
        r_v[0][2] = past[0];
        r_v[1][2] = past[1];
        r_v[2][2] = past[2];        
    }
}

void up(bool tf){
    char past[3]= {f_v[0][0],f_v[0][1],f_v[0][2]};
    // 반대 없음
    if(tf){
        char past_v= u_v[0][0];
        u_v[0][0]= u_v[2][0];
        u_v[2][0]= u_v[2][2];
        u_v[2][2]= u_v[0][2];
        u_v[0][2]= past_v;
        past_v= u_v[0][1];
        u_v[0][1]= u_v[1][0];
        u_v[1][0]= u_v[2][1];
        u_v[2][1]= u_v[1][2];
        u_v[1][2]= past_v;
        //l->b->r->f
        f_v[0][0]= r_v[0][0];
        f_v[0][1]= r_v[0][1];
        f_v[0][2]= r_v[0][2];
        r_v[0][0]= b_v[0][0];
        r_v[0][1]= b_v[0][1];
        r_v[0][2]= b_v[0][2];
        b_v[0][0]= l_v[0][0];
        b_v[0][1]= l_v[0][1];
        b_v[0][2]= l_v[0][2];
        l_v[0][0]= past[0];
        l_v[0][1]= past[1];
        l_v[0][2]= past[2];
    }else{
        char past_v= u_v[0][0];
        u_v[0][0]= u_v[0][2];
        u_v[0][2]= u_v[2][2];
        u_v[2][2]= u_v[2][0];
        u_v[2][0]= past_v;
        past_v= u_v[0][1];
        u_v[0][1]= u_v[1][2];
        u_v[1][2]= u_v[2][1];
        u_v[2][1]= u_v[1][0];
        u_v[1][0]= past_v;
        // r->b->l->f
        f_v[0][0]= l_v[0][0];
        f_v[0][1]= l_v[0][1];
        f_v[0][2]= l_v[0][2];
        l_v[0][0]= b_v[0][0];
        l_v[0][1]= b_v[0][1];
        l_v[0][2]= b_v[0][2];
        b_v[0][0]= r_v[0][0];
        b_v[0][1]= r_v[0][1];
        b_v[0][2]= r_v[0][2];
        r_v[0][0]= past[0];
        r_v[0][1]= past[1];
        r_v[0][2]= past[2];
    }
}

void down(bool tf){
    // 반대 없음
    char past[3]= {f_v[2][0],f_v[2][1],f_v[2][2]};
    if(!tf){
        char past_v= d_v[0][0];
        d_v[0][0]= d_v[0][2];
        d_v[0][2]= d_v[2][2];
        d_v[2][2]= d_v[2][0];
        d_v[2][0]= past_v;
        past_v= d_v[0][1];
        d_v[0][1]= d_v[1][2];
        d_v[1][2]= d_v[2][1];
        d_v[2][1]= d_v[1][0];
        d_v[1][0]= past_v;

        //l->b->r->f
        f_v[2][0]= r_v[2][0];
        f_v[2][1]= r_v[2][1];
        f_v[2][2]= r_v[2][2];
        r_v[2][0]= b_v[2][0];
        r_v[2][1]= b_v[2][1];
        r_v[2][2]= b_v[2][2];
        b_v[2][0]= l_v[2][0];
        b_v[2][1]= l_v[2][1];
        b_v[2][2]= l_v[2][2];
        l_v[2][0]= past[0];
        l_v[2][1]= past[1];
        l_v[2][2]= past[2];
    }else{
        char past_v= d_v[0][0];
        d_v[0][0]= d_v[2][0];
        d_v[2][0]= d_v[2][2];
        d_v[2][2]= d_v[0][2];
        d_v[0][2]= past_v;
        past_v= d_v[0][1];
        d_v[0][1]= d_v[1][0];
        d_v[1][0]= d_v[2][1];
        d_v[2][1]= d_v[1][2];
        d_v[1][2]= past_v;
        // r->b->l->f
        f_v[2][0]= l_v[2][0];
        f_v[2][1]= l_v[2][1];
        f_v[2][2]= l_v[2][2];
        l_v[2][0]= b_v[2][0];
        l_v[2][1]= b_v[2][1];
        l_v[2][2]= b_v[2][2];
        b_v[2][0]= r_v[2][0];
        b_v[2][1]= r_v[2][1];
        b_v[2][2]= r_v[2][2];
        r_v[2][0]= past[0];
        r_v[2][1]= past[1];
        r_v[2][2]= past[2];
    }    
}

void left(bool tf){
    char past[3] = {f_v[0][0],f_v[1][0],f_v[2][0]};
    if(tf){
        char past_v= l_v[0][0];
        l_v[0][0]= l_v[2][0];
        l_v[2][0]= l_v[2][2];
        l_v[2][2]= l_v[0][2];
        l_v[0][2]= past_v;
        past_v= l_v[0][1];
        l_v[0][1]= l_v[1][0];
        l_v[1][0]= l_v[2][1];
        l_v[2][1]= l_v[1][2];
        l_v[1][2]= past_v;
        // d->b->u->f
        // u,b 반대
        // b,d 반대
        f_v[0][0]= u_v[0][0]; 
        f_v[1][0]= u_v[1][0];
        f_v[2][0]= u_v[2][0];
        u_v[2][0]= b_v[0][2];
        u_v[1][0]= b_v[1][2];
        u_v[0][0]= b_v[2][2];
        b_v[2][2]= d_v[0][0];
        b_v[1][2]= d_v[1][0];
        b_v[0][2]= d_v[2][0];
        d_v[0][0]= past[0];
        d_v[1][0]= past[1];
        d_v[2][0]= past[2];
    }else{
        char past_v= l_v[0][0];
        l_v[0][0]= l_v[0][2];
        l_v[0][2]= l_v[2][2];
        l_v[2][2]= l_v[2][0];
        l_v[2][0]= past_v;
        past_v= l_v[0][1];
        l_v[0][1]= l_v[1][2];
        l_v[1][2]= l_v[2][1];
        l_v[2][1]= l_v[1][0];
        l_v[1][0]= past_v;
        f_v[0][0]= d_v[0][0];
        f_v[1][0]= d_v[1][0];
        f_v[2][0]= d_v[2][0];
        d_v[2][0]= b_v[0][2];
        d_v[1][0]= b_v[1][2];
        d_v[0][0]= b_v[2][2];
        b_v[2][2]= u_v[0][0];
        b_v[1][2]= u_v[1][0];
        b_v[0][2]= u_v[2][0];
        u_v[0][0]= past[0];
        u_v[1][0]= past[1];
        u_v[2][0]= past[2];
    }
}

void right(bool tf){
    char past[3] = {f_v[0][2],f_v[1][2],f_v[2][2]};
    if(tf){
        char past_v= r_v[0][0];
        r_v[0][0]= r_v[2][0];
        r_v[2][0]= r_v[2][2];
        r_v[2][2]= r_v[0][2];
        r_v[0][2]= past_v;
        past_v= r_v[0][1];
        r_v[0][1]= r_v[1][0];
        r_v[1][0]= r_v[2][1];
        r_v[2][1]= r_v[1][2];
        r_v[1][2]= past_v;
        // d->b->u->f
        // u,b 반대
        // b,d 반대
        f_v[0][2]= d_v[0][2];
        f_v[1][2]= d_v[1][2];
        f_v[2][2]= d_v[2][2];
        d_v[2][2]= b_v[0][0];
        d_v[1][2]= b_v[1][0];
        d_v[0][2]= b_v[2][0];
        b_v[2][0]= u_v[0][2];
        b_v[1][0]= u_v[1][2];
        b_v[0][0]= u_v[2][2];
        u_v[0][2]= past[0];
        u_v[1][2]= past[1];
        u_v[2][2]= past[2];

        
    }else{
        char past_v= r_v[0][0];
        r_v[0][0]= r_v[0][2];
        r_v[0][2]= r_v[2][2];
        r_v[2][2]= r_v[2][0];
        r_v[2][0]= past_v;
        past_v= r_v[0][1];
        r_v[0][1]= r_v[1][2];
        r_v[1][2]= r_v[2][1];
        r_v[2][1]= r_v[1][0];
        r_v[1][0]= past_v;

        f_v[0][2]= u_v[0][2]; 
        f_v[1][2]= u_v[1][2];
        f_v[2][2]= u_v[2][2];
        u_v[2][2]= b_v[0][0];
        u_v[1][2]= b_v[1][0];
        u_v[0][2]= b_v[2][0];
        b_v[2][0]= d_v[0][2];
        b_v[1][0]= d_v[1][2];
        b_v[0][0]= d_v[2][2];
        d_v[0][2]= past[0];
        d_v[1][2]= past[1];
        d_v[2][2]= past[2];
    }
}


int main() {
    int T;
    cin >> T;
    for(int t=0; t<T;t++){
        init();
        int n;
        cin >> n;
        for(int i=0; i< n; i++){
            string x;
            cin >> x;
            bool tf = x[1]=='+' ? true : false;
            switch (x[0]){
                case 'F':
                    front(tf);
                    break;
                case 'B':
                    back(tf);
                    break;
                case 'L':
                    left(tf);
                    break;
                case 'R':
                    right(tf);
                    break;
                case 'U':
                    up(tf);
                    break;
                case 'D':
                    down(tf);
                    break;
                default:
                    break;
            }
            // for(int i=0;i<3;i++){
            //     for(int j=0;j<3;j++){
            //         cout << u_v[i][j];
            //     }cout <<'\n';
            // }
        }
        for(int i=0;i<3;i++){
            for(int j=0;j<3;j++){
                cout << u_v[i][j];
            }cout <<'\n';
        }
    }
}