#include <iostream>
#include <vector>

using namespace std;

int main(){
    ios::sync_with_stdio(false);
    cin.tie(NULL);

    int n;
    cin >> n;
    vector<vector<int> > dp(n+1, vector<int>(3,0));

    dp[0][0]=1;
    dp[0][1]=1;
    dp[0][2]=1;
    
    for (int i = 1; i < n; i++) {
        dp[i][0] = (dp[i - 1][0] + dp[i - 1][1] + dp[i - 1][2]) % 9901;
        dp[i][1] = (dp[i - 1][0] + dp[i - 1][2]) % 9901;
        dp[i][2] = (dp[i - 1][0] + dp[i - 1][1]) % 9901;
    }
    cout << (dp[n-1][0] + dp[n-1][1] + dp[n-1][2])% 9901;
/*
1 1 1
2 2 3
5 5 7 2*2+1
12 12 17 5*2+2
29 29 41 12*2+5
66      29*2 + 58 + 8
ㅁ  ㅁ +이전합
 ㄴ ㅁ
    ㅁ ㅁ
        ㄴ ㅁ
            ㅁ ㄴ
                ㄴ ㅁ
                ㅁ ㅁ
                    5
            ㅁ ㅁ
                ㄴ ㅁ
                ㅁ ㄴ
                ㅁ ㅁ
                    7
        ㅁ ㄴ
            ㄴ ㅁ
                ㅁ ㅁ
                ㅁ ㄴ
                    5
            ㅁ ㅁ
                ㅁ ㅁ
                ㄴ ㅁ
                ㅁ ㄴ
                    7
        ㅁ ㅁ
            ㄴ ㅁ
                ㅁ ㄴ
                ㅁ ㅁ
                    5
            ㅁ ㄴ
                ㄴ ㅁ
                ㅁ ㅁ
                    5
            ㅁ ㅁ
                ㄴ ㅁ
                ㅁ ㅁ
                ㅁ ㄴ
                    7
    ㅁ ㄴ
        ㄴ ㅁ
            ㅁ ㄴ
                ㄴ ㅁ
                ㅁ ㅁ
                    5
            ㅁ ㅁ
                ㄴ ㅁ
                ㅁ ㄴ
                ㅁ ㅁ
                    7
        ㅁ ㅁ
            ㄴ ㅁ
                ㅁ ㄴ
                ㅁ ㅁ
                    5
            ㅁ ㄴ
                ㄴ ㅁ
                ㅁ ㅁ
                    5
            ㅁ ㅁ
                ㄴ ㅁ
                ㅁ ㄴ
                ㅁ ㅁ
                    7
 ㅁ ㄴ
    ㄴ ㅁ
        ㅁ ㄴ
            ㄴ ㅁ
            ㅁ ㅁ
        ㅁ ㅁ
            ㄴ ㅁ
            ㅁ ㄴ
            ㅁ ㅁ
    ㅁ ㅁ
        ㅁ ㄴ
            ㄴ ㅁ
            ㅁ ㅁ
        ㄴ ㅁ
            ㅁ ㄴ
            ㅁ ㅁ
        ㅁ ㅁ
            ㄴ ㅁ
            ㅁ ㄴ
            ㅁ ㅁ
 ㅁ ㅁ 
    ㄴ ㅁ
        ㅁ ㄴ
            ㄴ ㅁ
            ㅁ ㅁ
        ㅁ ㅁ
            ㄴ ㅁ
            ㅁ ㅁ
            ㅁ ㄴ
    ㅁ ㄴ
        ㄴ ㅁ
            ㅁ ㄴ
            ㅁ ㅁ
        ㅁ ㅁ
            ㅁ ㄴ
            ㄴ ㅁ
            ㅁ ㅁ
    ㅁ ㅁ
        ㄴ ㅁ
            ㅁ ㄴ
            ㅁ ㅁ
        ㅁ ㄴ
            ㄴ ㅁ
            ㅁ ㅁ
        ㅁ ㅁ
            ㅁ ㄴ
            ㄴ ㅁ
            ㅁ ㅁ


*/

}